released/simple_sgpio_test_tool/demo_code/M261BSP_USB_HID_SGPIO/SampleCode/Template/m261_bridge_i2c.c
#include <string.h>

#include "NuMicro.h"
#include "bridge_le.h"
#include "m261_bridge_i2c.h"

#define M261_PIN_A(pin)        ((uint8_t)(0x00u | ((pin) & 0x0Fu)))
#define M261_PIN_B(pin)        ((uint8_t)(0x10u | ((pin) & 0x0Fu)))
#define M261_PIN_C(pin)        ((uint8_t)(0x20u | ((pin) & 0x0Fu)))
#define M261_PIN_F(pin)        ((uint8_t)(0x50u | ((pin) & 0x0Fu)))

#define M261_PIN_PORT(pin)     ((uint8_t)(((pin) >> 4) & 0x0Fu))
#define M261_PIN_INDEX(pin)    ((uint8_t)((pin) & 0x0Fu))

#define M261_BRIDGE_I2C_ROLE_NONE      0u
#define M261_BRIDGE_I2C_ROLE_MASTER    1u
#define M261_BRIDGE_I2C_ROLE_SLAVE     2u

typedef struct
{
    uint8_t initialized;
    uint8_t role;
    uint8_t sda_pin;
    uint8_t scl_pin;
    uint8_t addr7;
    uint32_t baudrate;
} M261_BRIDGE_I2C_STATE_T;

static M261_BRIDGE_I2C_STATE_T g_i2c_state[M261_BRIDGE_I2C_PORT_COUNT];
static uint8_t g_i2c_last_error = M261_BRIDGE_I2C_ERROR_NONE;
static volatile uint8_t g_i2c_slave_rx[M261_BRIDGE_I2C_PORT_COUNT][M261_BRIDGE_I2C_SLAVE_BUF_SIZE];
static volatile uint8_t g_i2c_slave_tx[M261_BRIDGE_I2C_PORT_COUNT][M261_BRIDGE_I2C_SLAVE_BUF_SIZE];
static volatile uint16_t g_i2c_slave_rx_len[M261_BRIDGE_I2C_PORT_COUNT];
static volatile uint16_t g_i2c_slave_tx_len[M261_BRIDGE_I2C_PORT_COUNT];
static volatile uint16_t g_i2c_slave_tx_index[M261_BRIDGE_I2C_PORT_COUNT];

static void BridgeI2c_ClearLastError(void)
{
    g_i2c_last_error = M261_BRIDGE_I2C_ERROR_NONE;
}

static void BridgeI2c_MarkIoError(void)
{
    if (g_i2c_last_error == M261_BRIDGE_I2C_ERROR_NONE)
    {
        g_i2c_last_error = M261_BRIDGE_I2C_ERROR_IO;
    }
}

static void BridgeI2c_MarkTimeout(void)
{
    g_i2c_last_error = M261_BRIDGE_I2C_ERROR_TIMEOUT;
}

static I2C_T *BridgeI2c_GetInst(uint8_t port)
{
    if (port == 0u)
    {
        return I2C0;
    }
    if (port == 1u)
    {
        return I2C1;
    }
    return 0;
}

static IRQn_Type BridgeI2c_GetIrq(uint8_t port)
{
    return (port == 0u) ? I2C0_IRQn : I2C1_IRQn;
}

static void BridgeI2c_ClearSlaveBuffers(uint8_t port)
{
    if (port >= M261_BRIDGE_I2C_PORT_COUNT)
    {
        return;
    }
    g_i2c_slave_rx_len[port] = 0u;
    g_i2c_slave_tx_len[port] = 0u;
    g_i2c_slave_tx_index[port] = 0u;
}

static void BridgeI2c_SlavePushRx(uint8_t port, uint8_t data)
{
    uint16_t index;

    if (port >= M261_BRIDGE_I2C_PORT_COUNT)
    {
        return;
    }
    index = g_i2c_slave_rx_len[port];
    if (index < M261_BRIDGE_I2C_SLAVE_BUF_SIZE)
    {
        g_i2c_slave_rx[port][index] = data;
        g_i2c_slave_rx_len[port] = (uint16_t)(index + 1u);
    }
}

static uint8_t BridgeI2c_SlaveNextTx(uint8_t port)
{
    uint16_t index;
    uint8_t data;

    data = 0xFFu;
    if (port >= M261_BRIDGE_I2C_PORT_COUNT)
    {
        return data;
    }
    index = g_i2c_slave_tx_index[port];
    if (index < g_i2c_slave_tx_len[port])
    {
        data = g_i2c_slave_tx[port][index];
        g_i2c_slave_tx_index[port] = (uint16_t)(index + 1u);
    }
    return data;
}

static GPIO_T *BridgeI2c_GetGpioPort(uint8_t pin_code)
{
    switch (M261_PIN_PORT(pin_code))
    {
        case 0u:
            return PA;
        case 1u:
            return PB;
        case 2u:
            return PC;
        case 5u:
            return PF;
        default:
            break;
    }
    return 0;
}

static uint32_t BridgeI2c_PinMask(uint8_t pin_code)
{
    uint8_t index;

    index = M261_PIN_INDEX(pin_code);
    if (index >= 16u)
    {
        return 0u;
    }
    return (uint32_t)(1ul << index);
}

static void BridgeI2c_SetPinOpenDrain(uint8_t pin_code)
{
    GPIO_T *gpio;
    uint32_t mask;

    gpio = BridgeI2c_GetGpioPort(pin_code);
    mask = BridgeI2c_PinMask(pin_code);
    if ((gpio != 0) && (mask != 0u))
    {
        GPIO_SetMode(gpio, mask, GPIO_MODE_OPEN_DRAIN);
    }
}

static void BridgeI2c_SetPinInput(uint8_t pin_code)
{
    GPIO_T *gpio;
    uint32_t mask;

    gpio = BridgeI2c_GetGpioPort(pin_code);
    mask = BridgeI2c_PinMask(pin_code);
    if ((gpio != 0) && (mask != 0u))
    {
        GPIO_SetMode(gpio, mask, GPIO_MODE_INPUT);
    }
}

static uint8_t BridgeI2c_ReadPin(uint8_t pin_code)
{
    GPIO_T *gpio;
    uint32_t mask;

    gpio = BridgeI2c_GetGpioPort(pin_code);
    mask = BridgeI2c_PinMask(pin_code);
    if ((gpio == 0) || (mask == 0u))
    {
        return 0u;
    }
    return ((gpio->PIN & mask) != 0u) ? 1u : 0u;
}

static void BridgeI2c_ReleasePin(uint8_t pin_code)
{
    GPIO_T *gpio;
    uint32_t mask;

    gpio = BridgeI2c_GetGpioPort(pin_code);
    mask = BridgeI2c_PinMask(pin_code);
    if ((gpio != 0) && (mask != 0u))
    {
        gpio->DOUT |= mask;
        GPIO_SetMode(gpio, mask, GPIO_MODE_OPEN_DRAIN);
    }
}

static void BridgeI2c_DrivePinLow(uint8_t pin_code)
{
    GPIO_T *gpio;
    uint32_t mask;

    gpio = BridgeI2c_GetGpioPort(pin_code);
    mask = BridgeI2c_PinMask(pin_code);
    if ((gpio != 0) && (mask != 0u))
    {
        gpio->DOUT &= ~mask;
        GPIO_SetMode(gpio, mask, GPIO_MODE_OPEN_DRAIN);
    }
}

static void BridgeI2c_DelayShort(void)
{
    volatile uint32_t index;

    for (index = 0u; index < 240u; ++index)
    {
    }
}

static uint8_t BridgeI2c_IsValidPair(uint8_t port, uint8_t sda_pin, uint8_t scl_pin)
{
    if (port == 0u)
    {
        if ((sda_pin == M261_PIN_B(4u)) && (scl_pin == M261_PIN_B(5u))) { return 1u; }
        if ((sda_pin == M261_PIN_F(2u)) && (scl_pin == M261_PIN_F(3u))) { return 1u; }
        if ((sda_pin == M261_PIN_A(4u)) && (scl_pin == M261_PIN_A(5u))) { return 1u; }
        if ((sda_pin == M261_PIN_C(0u)) && (scl_pin == M261_PIN_C(1u))) { return 1u; }
    }
    else if (port == 1u)
    {
        if ((sda_pin == M261_PIN_B(0u)) && (scl_pin == M261_PIN_B(1u))) { return 1u; }
        if ((sda_pin == M261_PIN_A(6u)) && (scl_pin == M261_PIN_A(7u))) { return 1u; }
        if ((sda_pin == M261_PIN_A(2u)) && (scl_pin == M261_PIN_A(3u))) { return 1u; }
        if ((sda_pin == M261_PIN_F(1u)) && (scl_pin == M261_PIN_F(0u))) { return 1u; }
        if ((sda_pin == M261_PIN_C(4u)) && (scl_pin == M261_PIN_C(5u))) { return 1u; }
        if ((sda_pin == M261_PIN_B(10u)) && (scl_pin == M261_PIN_B(11u))) { return 1u; }
    }
    return 0u;
}

static uint8_t BridgeI2c_ApplyMux(uint8_t port, uint8_t sda_pin, uint8_t scl_pin)
{
    if (BridgeI2c_IsValidPair(port, sda_pin, scl_pin) == 0u)
    {
        return 0u;
    }

    SYS_UnlockReg();

    if (port == 0u)
    {
        if ((sda_pin == M261_PIN_B(4u)) && (scl_pin == M261_PIN_B(5u)))
        {
            SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB4MFP_Msk | SYS_GPB_MFPL_PB5MFP_Msk)) |
                            (SYS_GPB_MFPL_PB4MFP_I2C0_SDA | SYS_GPB_MFPL_PB5MFP_I2C0_SCL);
        }
        else if ((sda_pin == M261_PIN_F(2u)) && (scl_pin == M261_PIN_F(3u)))
        {
            SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF2MFP_Msk | SYS_GPF_MFPL_PF3MFP_Msk)) |
                            (SYS_GPF_MFPL_PF2MFP_I2C0_SDA | SYS_GPF_MFPL_PF3MFP_I2C0_SCL);
        }
        else if ((sda_pin == M261_PIN_A(4u)) && (scl_pin == M261_PIN_A(5u)))
        {
            SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA4MFP_Msk | SYS_GPA_MFPL_PA5MFP_Msk)) |
                            (SYS_GPA_MFPL_PA4MFP_I2C0_SDA | SYS_GPA_MFPL_PA5MFP_I2C0_SCL);
        }
        else if ((sda_pin == M261_PIN_C(0u)) && (scl_pin == M261_PIN_C(1u)))
        {
            SYS->GPC_MFPL = (SYS->GPC_MFPL & ~(SYS_GPC_MFPL_PC0MFP_Msk | SYS_GPC_MFPL_PC1MFP_Msk)) |
                            (SYS_GPC_MFPL_PC0MFP_I2C0_SDA | SYS_GPC_MFPL_PC1MFP_I2C0_SCL);
        }
    }
    else
    {
        if ((sda_pin == M261_PIN_B(0u)) && (scl_pin == M261_PIN_B(1u)))
        {
            SYS->GPB_MFPL = (SYS->GPB_MFPL & ~(SYS_GPB_MFPL_PB0MFP_Msk | SYS_GPB_MFPL_PB1MFP_Msk)) |
                            (SYS_GPB_MFPL_PB0MFP_I2C1_SDA | SYS_GPB_MFPL_PB1MFP_I2C1_SCL);
        }
        else if ((sda_pin == M261_PIN_A(6u)) && (scl_pin == M261_PIN_A(7u)))
        {
            SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA6MFP_Msk | SYS_GPA_MFPL_PA7MFP_Msk)) |
                            (SYS_GPA_MFPL_PA6MFP_I2C1_SDA | SYS_GPA_MFPL_PA7MFP_I2C1_SCL);
        }
        else if ((sda_pin == M261_PIN_A(2u)) && (scl_pin == M261_PIN_A(3u)))
        {
            SYS->GPA_MFPL = (SYS->GPA_MFPL & ~(SYS_GPA_MFPL_PA2MFP_Msk | SYS_GPA_MFPL_PA3MFP_Msk)) |
                            (SYS_GPA_MFPL_PA2MFP_I2C1_SDA | SYS_GPA_MFPL_PA3MFP_I2C1_SCL);
        }
        else if ((sda_pin == M261_PIN_F(1u)) && (scl_pin == M261_PIN_F(0u)))
        {
            SYS->GPF_MFPL = (SYS->GPF_MFPL & ~(SYS_GPF_MFPL_PF1MFP_Msk | SYS_GPF_MFPL_PF0MFP_Msk)) |
                            (SYS_GPF_MFPL_PF1MFP_I2C1_SDA | SYS_GPF_MFPL_PF0MFP_I2C1_SCL);
        }
        else if ((sda_pin == M261_PIN_C(4u)) && (scl_pin == M261_PIN_C(5u)))
        {
            SYS->GPC_MFPL = (SYS->GPC_MFPL & ~(SYS_GPC_MFPL_PC4MFP_Msk | SYS_GPC_MFPL_PC5MFP_Msk)) |
                            (SYS_GPC_MFPL_PC4MFP_I2C1_SDA | SYS_GPC_MFPL_PC5MFP_I2C1_SCL);
        }
        else if ((sda_pin == M261_PIN_B(10u)) && (scl_pin == M261_PIN_B(11u)))
        {
            SYS->GPB_MFPH = (SYS->GPB_MFPH & ~(SYS_GPB_MFPH_PB10MFP_Msk | SYS_GPB_MFPH_PB11MFP_Msk)) |
                            (SYS_GPB_MFPH_PB10MFP_I2C1_SDA | SYS_GPB_MFPH_PB11MFP_I2C1_SCL);
        }
    }

    SYS_LockReg();

    BridgeI2c_SetPinOpenDrain(sda_pin);
    BridgeI2c_SetPinOpenDrain(scl_pin);
    BridgeI2c_ReleasePin(sda_pin);
    BridgeI2c_ReleasePin(scl_pin);

    return 1u;
}

static void BridgeI2c_ClearMuxToGpio(uint8_t port, uint8_t sda_pin, uint8_t scl_pin)
{
    SYS_UnlockReg();

    if (port == 0u)
    {
        if ((sda_pin == M261_PIN_B(4u)) && (scl_pin == M261_PIN_B(5u)))
        {
            SYS->GPB_MFPL &= ~(SYS_GPB_MFPL_PB4MFP_Msk | SYS_GPB_MFPL_PB5MFP_Msk);
        }
        else if ((sda_pin == M261_PIN_F(2u)) && (scl_pin == M261_PIN_F(3u)))
        {
            SYS->GPF_MFPL &= ~(SYS_GPF_MFPL_PF2MFP_Msk | SYS_GPF_MFPL_PF3MFP_Msk);
        }
        else if ((sda_pin == M261_PIN_A(4u)) && (scl_pin == M261_PIN_A(5u)))
        {
            SYS->GPA_MFPL &= ~(SYS_GPA_MFPL_PA4MFP_Msk | SYS_GPA_MFPL_PA5MFP_Msk);
        }
        else if ((sda_pin == M261_PIN_C(0u)) && (scl_pin == M261_PIN_C(1u)))
        {
            SYS->GPC_MFPL &= ~(SYS_GPC_MFPL_PC0MFP_Msk | SYS_GPC_MFPL_PC1MFP_Msk);
        }
    }
    else if (port == 1u)
    {
        if ((sda_pin == M261_PIN_B(0u)) && (scl_pin == M261_PIN_B(1u)))
        {
            SYS->GPB_MFPL &= ~(SYS_GPB_MFPL_PB0MFP_Msk | SYS_GPB_MFPL_PB1MFP_Msk);
        }
        else if ((sda_pin == M261_PIN_A(6u)) && (scl_pin == M261_PIN_A(7u)))
        {
            SYS->GPA_MFPL &= ~(SYS_GPA_MFPL_PA6MFP_Msk | SYS_GPA_MFPL_PA7MFP_Msk);
        }
        else if ((sda_pin == M261_PIN_A(2u)) && (scl_pin == M261_PIN_A(3u)))
        {
            SYS->GPA_MFPL &= ~(SYS_GPA_MFPL_PA2MFP_Msk | SYS_GPA_MFPL_PA3MFP_Msk);
        }
        else if ((sda_pin == M261_PIN_F(1u)) && (scl_pin == M261_PIN_F(0u)))
        {
            SYS->GPF_MFPL &= ~(SYS_GPF_MFPL_PF1MFP_Msk | SYS_GPF_MFPL_PF0MFP_Msk);
        }
        else if ((sda_pin == M261_PIN_C(4u)) && (scl_pin == M261_PIN_C(5u)))
        {
            SYS->GPC_MFPL &= ~(SYS_GPC_MFPL_PC4MFP_Msk | SYS_GPC_MFPL_PC5MFP_Msk);
        }
        else if ((sda_pin == M261_PIN_B(10u)) && (scl_pin == M261_PIN_B(11u)))
        {
            SYS->GPB_MFPH &= ~(SYS_GPB_MFPH_PB10MFP_Msk | SYS_GPB_MFPH_PB11MFP_Msk);
        }
    }

    SYS_LockReg();

