released/simple_sgpio_test_tool/demo_code/M261BSP_USB_HID_SGPIO/SampleCode/Template/m261_bridge_i2c.c
    BridgeI2c_SetPinInput(sda_pin);
    BridgeI2c_SetPinInput(scl_pin);
}

static void BridgeI2c_EnableClock(uint8_t port)
{
    SYS_UnlockReg();
    if (port == 0u)
    {
        CLK_EnableModuleClock(I2C0_MODULE);
        SYS_ResetModule(I2C0_RST);
    }
    else
    {
        CLK_EnableModuleClock(I2C1_MODULE);
        SYS_ResetModule(I2C1_RST);
    }
    SYS_LockReg();
}

static void BridgeI2c_DisableClock(uint8_t port)
{
    SYS_UnlockReg();
    if (port == 0u)
    {
        CLK_DisableModuleClock(I2C0_MODULE);
    }
    else
    {
        CLK_DisableModuleClock(I2C1_MODULE);
    }
    SYS_LockReg();
}

static uint8_t BridgeI2c_WaitReady(I2C_T *i2c)
{
    uint32_t timeout;

    timeout = SystemCoreClock;
    while ((i2c->CTL0 & I2C_CTL0_SI_Msk) == 0u)
    {
        if (timeout == 0u)
        {
            BridgeI2c_MarkTimeout();
            return 0u;
        }
        --timeout;
    }
    return 1u;
}

static uint8_t BridgeI2c_WaitStopClear(I2C_T *i2c)
{
    uint32_t timeout;

    timeout = SystemCoreClock;
    while ((i2c->CTL0 & I2C_CTL0_STO_Msk) != 0u)
    {
        if (timeout == 0u)
        {
            BridgeI2c_MarkTimeout();
            return 0u;
        }
        --timeout;
    }
    return 1u;
}

static void BridgeI2c_DelayBit(void)
{
    uint8_t count;

    for (count = 0u; count < 2u; ++count)
    {
        BridgeI2c_DelayShort();
    }
}

static uint8_t BridgeI2c_WaitPinHigh(uint8_t pin_code)
{
    uint32_t timeout;

    timeout = SystemCoreClock / 1000u;
    if (timeout < 1000u)
    {
        timeout = 1000u;
    }
    while (BridgeI2c_ReadPin(pin_code) == 0u)
    {
        if (timeout == 0u)
        {
            return 0u;
        }
        --timeout;
    }
    return 1u;
}

static uint8_t BridgeI2c_BitBangStart(uint8_t sda_pin, uint8_t scl_pin)
{
    BridgeI2c_ReleasePin(sda_pin);
    BridgeI2c_ReleasePin(scl_pin);
    if (BridgeI2c_WaitPinHigh(scl_pin) == 0u)
    {
        return 0u;
    }
    if (BridgeI2c_WaitPinHigh(sda_pin) == 0u)
    {
        return 0u;
    }
    BridgeI2c_DelayBit();
    BridgeI2c_DrivePinLow(sda_pin);
    BridgeI2c_DelayBit();
    BridgeI2c_DrivePinLow(scl_pin);
    BridgeI2c_DelayBit();
    return 1u;
}

static uint8_t BridgeI2c_BitBangStop(uint8_t sda_pin, uint8_t scl_pin)
{
    uint8_t ok;

    ok = 1u;
    BridgeI2c_DrivePinLow(sda_pin);
    BridgeI2c_DelayBit();
    BridgeI2c_ReleasePin(scl_pin);
    if (BridgeI2c_WaitPinHigh(scl_pin) == 0u)
    {
        ok = 0u;
    }
    BridgeI2c_DelayBit();
    BridgeI2c_ReleasePin(sda_pin);
    BridgeI2c_DelayBit();
    return ok;
}

static uint8_t BridgeI2c_BitBangWriteByte(uint8_t sda_pin, uint8_t scl_pin, uint8_t value, uint8_t *ack)
{
    uint8_t bit;
    uint8_t sample;

    if (ack != 0)
    {
        *ack = 0u;
    }

    for (bit = 0u; bit < 8u; ++bit)
    {
        if ((value & 0x80u) != 0u)
        {
            BridgeI2c_ReleasePin(sda_pin);
        }
        else
        {
            BridgeI2c_DrivePinLow(sda_pin);
        }
        BridgeI2c_DelayBit();
        BridgeI2c_ReleasePin(scl_pin);
        if (BridgeI2c_WaitPinHigh(scl_pin) == 0u)
        {
            return 0u;
        }
        BridgeI2c_DelayBit();
        BridgeI2c_DrivePinLow(scl_pin);
        BridgeI2c_DelayBit();
        value = (uint8_t)(value << 1u);
    }

    BridgeI2c_ReleasePin(sda_pin);
    BridgeI2c_DelayBit();
    BridgeI2c_ReleasePin(scl_pin);
    if (BridgeI2c_WaitPinHigh(scl_pin) == 0u)
    {
        return 0u;
    }
    BridgeI2c_DelayBit();
    sample = BridgeI2c_ReadPin(sda_pin);
    BridgeI2c_DrivePinLow(scl_pin);
    BridgeI2c_DelayBit();

    if (ack != 0)
    {
        *ack = (sample == 0u) ? 1u : 0u;
    }
    return 1u;
}

static uint8_t BridgeI2c_SmbusQuickReadBitBang(uint8_t port, uint8_t addr7, uint8_t *ack)
{
    I2C_T *i2c;
    uint8_t sda_pin;
    uint8_t scl_pin;
    uint8_t ok;
    uint8_t stop_ok;
    uint32_t baudrate;

    if (ack != 0)
    {
        *ack = 0u;
    }
    if ((port >= M261_BRIDGE_I2C_PORT_COUNT) || (addr7 > 0x7Fu) ||
        (ack == 0) ||
        (g_i2c_state[port].initialized == 0u) ||
        (g_i2c_state[port].role != M261_BRIDGE_I2C_ROLE_MASTER))
    {
        return 0u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    sda_pin = g_i2c_state[port].sda_pin;
    scl_pin = g_i2c_state[port].scl_pin;
    baudrate = g_i2c_state[port].baudrate;

    I2C_Close(i2c);
    BridgeI2c_ClearMuxToGpio(port, sda_pin, scl_pin);
    BridgeI2c_ReleasePin(sda_pin);
    BridgeI2c_ReleasePin(scl_pin);
    BridgeI2c_DelayBit();

    ok = BridgeI2c_BitBangStart(sda_pin, scl_pin);
    if (ok != 0u)
    {
        ok = BridgeI2c_BitBangWriteByte(sda_pin, scl_pin, (uint8_t)((addr7 << 1u) | 0x01u), ack);
    }
    stop_ok = BridgeI2c_BitBangStop(sda_pin, scl_pin);

    (void)BridgeI2c_ApplyMux(port, sda_pin, scl_pin);
    (void)I2C_Open(i2c, baudrate);
    I2C_DisableInt(i2c);
    I2C_EnableTimeout(i2c, 0u);

    if ((ok == 0u) || (stop_ok == 0u))
    {
        BridgeI2c_MarkTimeout();
        return 0u;
    }
    return 1u;
}

uint8_t M261BridgeI2c_IsMasterReady(uint8_t port)
{
    if (port >= M261_BRIDGE_I2C_PORT_COUNT)
    {
        return 0u;
    }
    return ((g_i2c_state[port].initialized != 0u) &&
            (g_i2c_state[port].role == M261_BRIDGE_I2C_ROLE_MASTER)) ? 1u : 0u;
}

uint8_t M261BridgeI2c_IsSlaveReady(uint8_t port)
{
    if (port >= M261_BRIDGE_I2C_PORT_COUNT)
    {
        return 0u;
    }
    return ((g_i2c_state[port].initialized != 0u) &&
            (g_i2c_state[port].role == M261_BRIDGE_I2C_ROLE_SLAVE)) ? 1u : 0u;
}

uint8_t M261BridgeI2c_LastError(void)
{
    return g_i2c_last_error;
}

uint8_t M261BridgeI2c_InitMaster(uint8_t port, uint8_t sda_pin, uint8_t scl_pin, uint32_t baudrate)
{
    I2C_T *i2c;
    uint8_t other_port;

    BridgeI2c_ClearLastError();

    if ((port >= M261_BRIDGE_I2C_PORT_COUNT) ||
        (BridgeI2c_IsValidPair(port, sda_pin, scl_pin) == 0u))
    {
        return 0u;
    }

    if (baudrate < 10000u)
    {
        baudrate = 10000u;
    }
    if (baudrate > 1000000u)
    {
        baudrate = 1000000u;
    }

