released/simple_sgpio_test_tool/demo_code/M261BSP_USB_HID_SGPIO/SampleCode/Template/m261_bridge_i2c.c
    other_port = (port == 0u) ? 1u : 0u;
    M261BridgeI2c_Deinit(other_port);
    M261BridgeI2c_Deinit(port);

    BridgeI2c_EnableClock(port);
    if (BridgeI2c_ApplyMux(port, sda_pin, scl_pin) == 0u)
    {
        BridgeI2c_DisableClock(port);
        return 0u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        BridgeI2c_DisableClock(port);
        return 0u;
    }

    (void)I2C_Open(i2c, baudrate);
    I2C_DisableInt(i2c);
    NVIC_DisableIRQ(BridgeI2c_GetIrq(port));
    NVIC_ClearPendingIRQ(BridgeI2c_GetIrq(port));
    I2C_EnableTimeout(i2c, 0u);

    g_i2c_state[port].initialized = 1u;
    g_i2c_state[port].role = M261_BRIDGE_I2C_ROLE_MASTER;
    g_i2c_state[port].sda_pin = sda_pin;
    g_i2c_state[port].scl_pin = scl_pin;
    g_i2c_state[port].addr7 = 0u;
    g_i2c_state[port].baudrate = baudrate;
    return 1u;
}

uint8_t M261BridgeI2c_InitSlave(uint8_t port, uint8_t sda_pin, uint8_t scl_pin, uint8_t addr7, uint32_t baudrate)
{
    I2C_T *i2c;
    uint8_t other_port;

    BridgeI2c_ClearLastError();

    if ((port >= M261_BRIDGE_I2C_PORT_COUNT) ||
        (addr7 > 0x7Fu) ||
        (BridgeI2c_IsValidPair(port, sda_pin, scl_pin) == 0u))
    {
        return 0u;
    }

    if (baudrate < 10000u)
    {
        baudrate = 10000u;
    }
    if (baudrate > 1000000u)
    {
        baudrate = 1000000u;
    }

    other_port = (port == 0u) ? 1u : 0u;
    M261BridgeI2c_Deinit(other_port);
    M261BridgeI2c_Deinit(port);

    BridgeI2c_EnableClock(port);
    if (BridgeI2c_ApplyMux(port, sda_pin, scl_pin) == 0u)
    {
        BridgeI2c_DisableClock(port);
        return 0u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        BridgeI2c_DisableClock(port);
        return 0u;
    }

    (void)I2C_Open(i2c, baudrate);
    I2C_EnableTimeout(i2c, 0u);
    I2C_SetSlaveAddr(i2c, 0u, addr7, 0u);
    I2C_SetSlaveAddrMask(i2c, 0u, 0u);
    BridgeI2c_ClearSlaveBuffers(port);

    g_i2c_state[port].initialized = 1u;
    g_i2c_state[port].role = M261_BRIDGE_I2C_ROLE_SLAVE;
    g_i2c_state[port].sda_pin = sda_pin;
    g_i2c_state[port].scl_pin = scl_pin;
    g_i2c_state[port].addr7 = addr7;
    g_i2c_state[port].baudrate = baudrate;

    I2C_EnableInt(i2c);
    NVIC_ClearPendingIRQ(BridgeI2c_GetIrq(port));
    NVIC_EnableIRQ(BridgeI2c_GetIrq(port));
    I2C_SET_CONTROL_REG(i2c, I2C_CTL_SI_AA);
    return 1u;
}

void M261BridgeI2c_Deinit(uint8_t port)
{
    I2C_T *i2c;
    uint8_t sda_pin;
    uint8_t scl_pin;
    uint8_t was_slave;

    if (port >= M261_BRIDGE_I2C_PORT_COUNT)
    {
        return;
    }

    BridgeI2c_ClearLastError();

    i2c = BridgeI2c_GetInst(port);
    sda_pin = g_i2c_state[port].sda_pin;
    scl_pin = g_i2c_state[port].scl_pin;
    was_slave = (g_i2c_state[port].role == M261_BRIDGE_I2C_ROLE_SLAVE) ? 1u : 0u;

    if (i2c != 0)
    {
        if (was_slave != 0u)
        {
            I2C_DisableInt(i2c);
            NVIC_DisableIRQ(BridgeI2c_GetIrq(port));
            NVIC_ClearPendingIRQ(BridgeI2c_GetIrq(port));
        }
        I2C_Close(i2c);
    }

    if (g_i2c_state[port].initialized != 0u)
    {
        BridgeI2c_ClearMuxToGpio(port, sda_pin, scl_pin);
    }

    memset(&g_i2c_state[port], 0, sizeof(g_i2c_state[port]));
    BridgeI2c_ClearSlaveBuffers(port);
    BridgeI2c_DisableClock(port);
}

uint8_t M261BridgeI2c_MasterWrite(uint8_t port, uint8_t addr7, const uint8_t *data, uint16_t len, uint16_t *written)
{
    I2C_T *i2c;
    uint8_t xfering;
    uint8_t err;
    uint8_t ctrl;
    uint32_t tx_len;
    uint32_t status;

    BridgeI2c_ClearLastError();

    if (written != 0)
    {
        *written = 0u;
    }
    if ((port >= M261_BRIDGE_I2C_PORT_COUNT) || (addr7 > 0x7Fu) ||
        (M261BridgeI2c_IsMasterReady(port) == 0u) || ((data == 0) && (len != 0u)))
    {
        return 0u;
    }
    if (len == 0u)
    {
        return 1u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    xfering = 1u;
    err = 0u;
    ctrl = I2C_CTL_SI;
    tx_len = 0u;

    I2C_START(i2c);
    while ((xfering != 0u) && (err == 0u))
    {
        if (BridgeI2c_WaitReady(i2c) == 0u)
        {
            BridgeI2c_MarkIoError();
            err = 1u;
            break;
        }

        status = I2C_GET_STATUS(i2c);
        switch (status)
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)(addr7 << 1u));
                ctrl = I2C_CTL_SI;
                break;

            case 0x18u:
            case 0x28u:
                if (tx_len < len)
                {
                    I2C_SET_DATA(i2c, data[tx_len]);
                    ++tx_len;
                    ctrl = I2C_CTL_SI;
                }
                else
                {
                    ctrl = I2C_CTL_STO_SI;
                    xfering = 0u;
                }
                break;

            case 0x30u:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;

            case 0x20u:
            case 0x38u:
            default:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, ctrl);
    }

    if (BridgeI2c_WaitStopClear(i2c) == 0u)
    {
        BridgeI2c_MarkIoError();
        err = 1u;
    }
    if (written != 0)
    {
        *written = (uint16_t)tx_len;
    }
    if ((err == 0u) && (tx_len == len))
    {
        return 1u;
    }
    BridgeI2c_MarkIoError();
    return 0u;
}

uint8_t M261BridgeI2c_MasterRead(uint8_t port, uint8_t addr7, uint8_t *out, uint16_t len, uint16_t *read_len)
{
    I2C_T *i2c;
    uint8_t xfering;
    uint8_t err;
    uint8_t ctrl;
    uint32_t rx_len;
    uint32_t status;

    BridgeI2c_ClearLastError();

    if (read_len != 0)
    {
        *read_len = 0u;
    }
    if ((port >= M261_BRIDGE_I2C_PORT_COUNT) || (addr7 > 0x7Fu) ||
        (M261BridgeI2c_IsMasterReady(port) == 0u) || ((out == 0) && (len != 0u)))
    {
        return 0u;
    }
    if (len == 0u)
    {
        return 1u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    xfering = 1u;
    err = 0u;
    ctrl = I2C_CTL_SI;
    rx_len = 0u;

    I2C_START(i2c);
    while ((xfering != 0u) && (err == 0u))
    {
        if (BridgeI2c_WaitReady(i2c) == 0u)
        {
            BridgeI2c_MarkIoError();
            err = 1u;
            break;
        }

        status = I2C_GET_STATUS(i2c);
        switch (status)
        {
            case 0x08u:
                I2C_SET_DATA(i2c, (uint8_t)((addr7 << 1u) | 0x01u));
                ctrl = I2C_CTL_SI;
                break;

