released/simple_sgpio_test_tool/demo_code/M261BSP_USB_HID_SGPIO/SampleCode/Template/m261_bridge_i2c.c
            case 0x40u:
                ctrl = I2C_CTL_SI_AA;
                break;

            case 0x50u:
                out[rx_index] = (uint8_t)I2C_GET_DATA(i2c);
                ++rx_index;
                if (target_known == 0u)
                {
                    block_count = out[0];
                    if (block_count > max_block_len)
                    {
                        BridgeI2c_MarkIoError();
                        err = 1u;
                        ctrl = I2C_CTL_STO_SI;
                        break;
                    }
                    target_len = (uint16_t)(1u + block_count + ((expect_pec != 0u) ? 1u : 0u));
                    target_known = 1u;
                }

                if (rx_index >= target_len)
                {
                    ctrl = I2C_CTL_STO_SI;
                    xfering = 0u;
                }
                else
                {
                    ctrl = (rx_index < ((uint32_t)target_len - 1u)) ? I2C_CTL_SI_AA : I2C_CTL_SI;
                }
                break;

            case 0x58u:
                out[rx_index] = (uint8_t)I2C_GET_DATA(i2c);
                ++rx_index;
                ctrl = I2C_CTL_STO_SI;
                xfering = 0u;
                break;

            case 0x20u:
            case 0x30u:
            case 0x38u:
            case 0x48u:
            default:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, ctrl);
    }

    if (BridgeI2c_WaitStopClear(i2c) == 0u)
    {
        BridgeI2c_MarkIoError();
        err = 1u;
    }
    *out_len = (uint16_t)rx_index;
    if ((err == 0u) && (target_known != 0u) && (rx_index >= target_len))
    {
        return 1u;
    }
    BridgeI2c_MarkIoError();
    return 0u;
}

static uint8_t BridgeI2c_ValidateGroupBlob(const uint8_t *segment_blob, uint16_t blob_len, uint8_t segment_count)
{
    uint16_t offset;
    uint16_t segment_len;
    uint8_t index;

    offset = 0u;
    for (index = 0u; index < segment_count; ++index)
    {
        if ((uint16_t)(offset + 3u) > blob_len)
        {
            return 0u;
        }
        segment_len = Bridge_ReadU16Le(&segment_blob[offset + 1u]);
        if ((segment_len == 0u) || ((uint16_t)(offset + 3u + segment_len) > blob_len))
        {
            return 0u;
        }
        offset = (uint16_t)(offset + 3u + segment_len);
    }
    return (offset == blob_len) ? 1u : 0u;
}

uint8_t M261BridgeI2c_GroupWrite(uint8_t port, const uint8_t *segment_blob, uint16_t blob_len,
                                 uint8_t segment_count, uint8_t *completed_segments)
{
    I2C_T *i2c;
    uint8_t xfering;
    uint8_t err;
    uint8_t ctrl;
    uint8_t index;
    uint8_t addr7;
    uint16_t offset;
    uint16_t segment_len;
    uint16_t data_offset;
    uint16_t tx_index;
    uint32_t status;

    BridgeI2c_ClearLastError();

    if (completed_segments != 0)
    {
        *completed_segments = 0u;
    }
    if ((port >= M261_BRIDGE_I2C_PORT_COUNT) || (segment_blob == 0) ||
        (segment_count == 0u) || (M261BridgeI2c_IsMasterReady(port) == 0u) ||
        (BridgeI2c_ValidateGroupBlob(segment_blob, blob_len, segment_count) == 0u))
    {
        return 0u;
    }

    i2c = BridgeI2c_GetInst(port);
    if (i2c == 0)
    {
        return 0u;
    }

    xfering = 1u;
    err = 0u;
    ctrl = I2C_CTL_SI;
    index = 0u;
    offset = 0u;
    addr7 = segment_blob[0] & 0x7Fu;
    segment_len = Bridge_ReadU16Le(&segment_blob[1]);
    data_offset = 3u;
    tx_index = 0u;

    I2C_START(i2c);
    while ((xfering != 0u) && (err == 0u))
    {
        if (BridgeI2c_WaitReady(i2c) == 0u)
        {
            BridgeI2c_MarkIoError();
            err = 1u;
            break;
        }

        status = I2C_GET_STATUS(i2c);
        switch (status)
        {
            case 0x08u:
            case 0x10u:
                I2C_SET_DATA(i2c, (uint8_t)(addr7 << 1u));
                ctrl = I2C_CTL_SI;
                break;

            case 0x18u:
            case 0x28u:
                if (tx_index < segment_len)
                {
                    I2C_SET_DATA(i2c, segment_blob[data_offset + tx_index]);
                    ++tx_index;
                    ctrl = I2C_CTL_SI;
                }
                else
                {
                    ++index;
                    if (completed_segments != 0)
                    {
                        *completed_segments = index;
                    }
                    if (index >= segment_count)
                    {
                        ctrl = I2C_CTL_STO_SI;
                        xfering = 0u;
                    }
                    else
                    {
                        offset = (uint16_t)(data_offset + segment_len);
                        addr7 = segment_blob[offset] & 0x7Fu;
                        segment_len = Bridge_ReadU16Le(&segment_blob[offset + 1u]);
                        data_offset = (uint16_t)(offset + 3u);
                        tx_index = 0u;
                        ctrl = I2C_CTL_STA_SI;
                    }
                }
                break;

            case 0x20u:
            case 0x30u:
            case 0x38u:
            default:
                ctrl = I2C_CTL_STO_SI;
                BridgeI2c_MarkIoError();
                err = 1u;
                break;
        }

        I2C_SET_CONTROL_REG(i2c, ctrl);
    }

    if (BridgeI2c_WaitStopClear(i2c) == 0u)
    {
        BridgeI2c_MarkIoError();
        err = 1u;
    }
    if (err == 0u)
    {
        return 1u;
    }
    BridgeI2c_MarkIoError();
    return 0u;
}

uint8_t M261BridgeI2c_BusStatus(uint8_t port, uint8_t recover_if_needed,
                                uint8_t *idle_before, uint8_t *recovered, uint8_t *idle_after)
{
    uint8_t sda_pin;
    uint8_t scl_pin;
    uint8_t idle;
    uint8_t count;
    uint32_t baudrate;
    I2C_T *i2c;

    BridgeI2c_ClearLastError();

    if ((port >= M261_BRIDGE_I2C_PORT_COUNT) || (M261BridgeI2c_IsMasterReady(port) == 0u) ||
        (idle_before == 0) || (recovered == 0) || (idle_after == 0))
    {
        return 0u;
    }

    sda_pin = g_i2c_state[port].sda_pin;
    scl_pin = g_i2c_state[port].scl_pin;
    baudrate = g_i2c_state[port].baudrate;
    i2c = BridgeI2c_GetInst(port);

    idle = ((BridgeI2c_ReadPin(sda_pin) != 0u) && (BridgeI2c_ReadPin(scl_pin) != 0u)) ? 1u : 0u;
    *idle_before = idle;
    *recovered = 0u;

    if ((idle == 0u) && (recover_if_needed != 0u) && (i2c != 0))
    {
        I2C_Close(i2c);
        BridgeI2c_ReleasePin(sda_pin);
        BridgeI2c_ReleasePin(scl_pin);
        BridgeI2c_DelayShort();

        for (count = 0u; count < 9u; ++count)
        {
            BridgeI2c_DrivePinLow(scl_pin);
            BridgeI2c_DelayShort();
            BridgeI2c_ReleasePin(scl_pin);
            BridgeI2c_DelayShort();
        }

        BridgeI2c_DrivePinLow(sda_pin);
        BridgeI2c_DelayShort();
        BridgeI2c_ReleasePin(scl_pin);
        BridgeI2c_DelayShort();
        BridgeI2c_ReleasePin(sda_pin);
        BridgeI2c_DelayShort();

        (void)BridgeI2c_ApplyMux(port, sda_pin, scl_pin);
        (void)I2C_Open(i2c, baudrate);
        I2C_EnableTimeout(i2c, 0u);
        *recovered = 1u;
    }

    *idle_after = ((BridgeI2c_ReadPin(sda_pin) != 0u) && (BridgeI2c_ReadPin(scl_pin) != 0u)) ? 1u : 0u;
    return 1u;
}

uint8_t M261BridgeI2c_SmbusQuick(uint8_t port, uint8_t addr7, uint8_t read_bit, uint8_t *ack)
{
    I2C_T *i2c;
    uint8_t xfering;
    uint8_t err;
    uint8_t ctrl;
    uint32_t status;

